"""
Source Reputation Database
"""

SOURCE_REPUTATION = {

    # ========================================================
    # بین‌المللی
    # ========================================================

    "Reuters": 100,
    "AP": 100,
    "AFP": 98,
    "BBC": 96,
    "CNN": 94,
    "CNN World": 94,
    "Al Jazeera": 92,
    "The Guardian World": 90,
    "The New York Times World": 92,

    # ========================================================
    # ایران
    # ========================================================

    "IRNA": 85,
    "ISNA": 84,
    "ایسنا": 84,
    "Tasnim": 82,
    "خبرگزاری تسنیم": 82,
    "Mehr": 82,
    "خبرگزاری مهر": 82,
    "Fars": 80,
    "KhabarFoory": 75,
    "خبرآنلاین": 78,
    "تابناک": 75,
    "باشگاه خبرنگاران جوان": 72,

}
