"""
Source Reputation Database
"""

SOURCE_REPUTATION = {

    # ========================================================
    # بین‌المللی
    # ========================================================

    "Reuters": 100,
    "AP": 100,
    "AFP": 98,
    "BBC": 96,
    "CNN": 94,
    "Al Jazeera": 92,
    "Guardian": 90,
    "The New York Times": 92,

    # ========================================================
    # ایران
    # ========================================================

    "IRNA": 85,
    "ISNA": 84,
    "Tasnim News": 82,
    "Mehr News": 82,
    "Fars": 80,
    "Khabar Online": 78,
    "Tabnak": 75,
    "YJC": 72,

}
